{
  "iridium.texts.fatal_error": "Iridium - A critical error has occurred!",

  "iridium.options.gui_title": "Minecraft Game Options",
  "iridium.options.texts.corrupt_config": "If you're seeing this screen, then Iridium has failed to load to its configuration file. This can happen as a result of the file somehow getting corrupted on disk or making a mistake when manually editing it by hand.%sTo fix this, simply click the button below to close the game and have Iridium replace the corrupted config file with a default one. You can then restart the game afterwards. If you would like more information, check the logs for a stacktrace from a JsonSyntaxException.",
  "iridium.options.button.close_game_and_reset_corrupt_config": "Quit Minecraft and Reset Iridium Config",

  "iridium.option.performanceImpact.none": "§7Performance Impact: None",
  "iridium.option.performanceImpact.low": "§7Performance Impact: §aLow",
  "iridium.option.performanceImpact.medium": "§7Performance Impact: §6Medium",
  "iridium.option.performanceImpact.high": "§7Performance Impact: §cHigh",
  "iridium.option.performanceImpact.varies": "§7Performance Impact: §fVaries",

  "iridium.options.category.video": "Video",
  "iridium.options.group.display": "Display",
  "iridium.options.display.vSync": "V-Sync (Vertical Sync)",
  "iridium.options.display.fullscreen.description": "If enabled and it's supported, the game will be displayed in fullscreen.",
  "iridium.options.display.fullscreenResolution.description": "Determines the resolution that the game will in run in when playing in fullscreen.",
  "iridium.options.display.vSync.description": "Synchronizes the game's framerate to the monitor's refresh rate and fixes screen tearing, making for a generally smoother experience, but input latency will be significantly worse. On slower systems, this setting may reduce performance.",
  "iridium.options.display.framerateLimit": "Framerate Limit",
  "iridium.options.display.framerateLimit.description": "Sets of the maximum number of frames that the game can render per second. This is can help save processing power and reduce battery usage.\n\nIf VSync is enabled, this setting will be ignored unless it is set to a value lower than your monitor's refresh rate.",
  "iridium.options.group.graphics": "Graphics",
  "iridium.options.graphics.brightness.description": "Dims down or lights up the game's surfaces, even if it is fully dark. It has no effect on gameplay and is purely a visual effect.",
  "iridium.options.graphics.fov.description": "FOV (Field of View) controls how much of the world is visible on the screen.\n\nIn Minecraft, the FOV value represents how many degrees of vertical vision the player gets without things such as sprinting, flying or status effects modifying it. Note that the FOV setting present in other games might represent different angles, meaning that using the same FOV value across different games or from a different game in Minecraft can give different results.\n\nFor more information, refer to the description of the setting on the",
  "iridium.options.graphics.fov.descriptionLink": "Minecraft wiki. (Click this to visit the page)",
  "iridium.options.graphics.fov.normal": "%d (Normal)",
  "iridium.options.graphics.fov.quakePro": "%d (Quake Pro)",
  "iridium.options.graphics.guiScale.description": "Controls the size of the game's user interface. The options available depend on the resolution that the game is being run in.",
  "iridium.options.graphics.viewBobbing.description": "If enabled, the camera will do a bobbing motion as the player walks. Disabling this may increase performance.",
  "iridium.options.graphics.attackIndicator.description": "If enabled, an indicator will be shown that displays how long you have to wait until you can attack at full power.\n\n§lOff§r - Disables the attack indicator.\n\n§lCrosshair§r - A little gray translucent bar appears below the crosshair displaying attack power.\n\n§lHotbar§r - A little gray sword bar appears on the side of the hotbar (on the same side as the player's main hand) displaying attack power.",
  "iridium.options.graphics.resourcePacks": "Resource Packs",
  "iridium.options.graphics.resourcePacks.description": "Opens a separate screen where you can configure your resource packs.",
  "iridium.options.group.graphicsQuality": "Graphics Quality",
  "iridium.options.graphicsQuality.renderDistance.description": "Controls how many chunks of the world are visible at once. Shorter distances means fewer chunks will be rendered, therefore improving frame rates.",
  "iridium.options.graphicsQuality.simulationDistance.description": "Similar to render distance, but instead controls the number of chunks in which entities are updated, and blocks and fluids are ticked. Shorter distances can reduce load on the integrated server and may improve frame rates.",
  "iridium.options.graphicsQuality.entityDistance.description": "Controls how far away entities are rendered from the player. Higher values mean that entities can be seen from further, but at the expense of frame rates.",
  "iridium.options.graphicsQuality.graphicsMode": "Graphics Quality",
  "iridium.options.graphicsQuality.graphicsMode.description": "Controls some legacy options and is necessary for compatibility with mods.\n\nIn the context of Iridium, the only thing that this settings affects is the rendering of particles behind transparent blocks such as slime and water. Other visual effects that were originally managed by this settings such as transparent leaves and the vignette are now standalone settings.",
  "iridium.options.graphicsQuality.clouds": "Clouds Quality",
  "iridium.options.graphicsQuality.clouds.description": "Controls how clouds are rendered in-game.\n\n§lOff§r - Clouds are disabled and will not be rendered.\n§lFast§r - Clouds are rendered in 2D.\n§lFancy§r - Clouds are rendered in 3D.",
  "iridium.options.graphicsQuality.weather": "Weather Quality",
  "iridium.options.graphicsQuality.weather.description": "Controls the quality of rain and show.",
  "iridium.options.graphicsQuality.leaves": "Leaves Quality",
  "iridium.options.graphicsQuality.leaves.description": "Controls the quality of leaves.\n\nA setting of medium or higher will make leaves see-through.",
  "iridium.options.graphicsQuality.particles.description": "Controls the maximum number of particles that can be on screen at any given time.\n\n§lAll§r - Any and all particles will be shown.\n\n§lDecreased§r - For some particles events, the amount of particles is reduced.\n\n§lMinimal§r - The amount of visible particles is reduced even further and some non-essential particles are disabled.",
  "iridium.options.graphicsQuality.smoothLighting.description": "If enabled, light levels will be blended across blocks and corners will be darkened using ambient occlusion to add semi-realistic shadows and glowing from light sources.\n\nThis setting does not affect gameplay, but it has a slight effect on performance.",
  "iridium.options.graphicsQuality.biomeBlend": "Biome Blend Radius",
  "iridium.options.graphicsQuality.biomeBlend.description": "Sets the distance of color transitions between biomes.",
  "iridium.options.graphicsQuality.entityShadows": "Show Entity Shadows",
  "iridium.options.graphicsQuality.entityShadows.description": "If enabled, basic shadows be rendered underneath all mobs and entities.",
  "iridium.options.graphicsQuality.enableVignette": "Show Vignette",
  "iridium.options.graphicsQuality.enableVignette.description": "If enabled, the corners of the screen will be darkened or have red glow when standing near the world border. This is very unlikely to make a difference in frame rates.",
  "iridium.options.graphicsQuality.distortionEffects.description": "Controls the strength of the distortion effects caused by nausea and standing in a nether portal. At lower values, a green overlay will replace the nausea effect.",
  "iridium.options.graphicsQuality.fovEffects.description": "Controls how the field of view can change with gameplay effects.",
  "iridium.options.graphicsQuality.mipmapLevels.description": "Controls the number of mipmaps that will be used for textures. Higher values provide better rendering of far away blocks, but may affect performance with animated textures.",
  "iridium.options.group.advancedGraphics": "Advanced Graphics",
  "iridium.options.advancedGraphics.showFPSOverlay": "Show FPS",
  "iridium.options.advancedGraphics.showFPSOverlay.description": "If enabled, your current FPS, as well as your average, highest and lowest, will be displayed.",
  "iridium.advancedGraphics.fpsOverlay": "%d FPS (Average: %d | Highest: %d | Lowest: %d)",
  "iridium.options.advancedGraphics.showCoordinates": "Show Coordinates",
  "iridium.options.advancedGraphics.showCoordinates.description": "If enabled, your current coordinates in the world will be displayed.",
  "iridium.advancedGraphics.coordinatesOverlay": "X: %s, Y: %s, Z: %s",
  "iridium.options.advancedGraphics.overlayContrast": "Overlay Contrast",
  "iridium.options.advancedGraphics.textContrast.description": "Controls the effect that the text of overlays will use to contrast from other things such as the world.\n\n§lNone§r - Default, plain white text.\n\n§lBackground§r - Text will be rendered with a background like the debug menu.\n\n§lShadow§r - Text will be rendered with a shadow.",
  "iridium.options.advancedGraphics.overlayPosition": "Overlay Position",
  "iridium.options.advancedGraphics.overlayPosition.description": "Controls the position in which overlays will be rendered on the screen.",
  "iridium.options.overlayPosition.topLeft": "Top Left",
  "iridium.options.overlayPosition.topRight": "Top Right",
  "iridium.options.overlayPosition.bottomLeft": "Bottom Left",
  "iridium.options.overlayPosition.bottomRight": "Bottom Right",

  "iridium.options.category.audio": "Audio",
  "iridium.options.group.volume": "Volume",
  "iridium.options.volume.masterVolume.description": "Controls the volume of every sound in the game as well as all of the music.",
  "iridium.options.volume.musicVolume.description": "Controls the volume of the music which can be heard on the title screen and during gameplay.",
  "iridium.options.volume.recordVolume.description": "Controls the volume of music and sounds played from jukeboxes and note blocks.",
  "iridium.options.volume.weatherVolume.description": "Controls the volume of rain and thunder.",
  "iridium.options.volume.blockVolume.description": "Controls the volume of blocks such as pistons, chests and doors.",
  "iridium.options.volume.hostileCreaturesVolume.description": "Controls the volume of hostile entities except for slimes and magma cubes.",
  "iridium.options.volume.friendlyCreaturesVolume.description": "Controls the volume of friendly entities such as animals (except Hoglins) and non-mob entities like minecarts, as well as slimes and magma cubes.",
  "iridium.options.volume.playersVolume.description": "Controls the volume of sounds made by players such as hurt sounds.",
  "iridium.options.volume.ambienceVolume.description": "Controls the volume of ambient sounds, the sound of entering/exiting water and fireworks.",
  "iridium.options.volume.voiceVolume.description": "Controls the volume of speech. This is really just for map makers.",
  "iridium.options.group.sound": "Sound",
  "iridium.options.sound.outputDevice": "Output Device",
  "iridium.options.sound.outputDevice.description": "Determines which device will be used to play game audio out of.",
  "iridium.options.sound.directionalAudio.description": "If enabled, HRTF (Head-Related Transfer Function) based directional audio will be used to provide better 3D spatialization of sound, therefore allowing you to better locate where sounds are coming from.\n\nIf you use spatial audio from any external applications such as Razer's THX or SteelSeries Sonar, this setting should be disabled.",
  "iridium.options.sound.showSubtitles.description": "If enabled, subtitles will be shown that display a description of nearby sounds as well as from which direction they are coming from.",

  "iridium.options.category.controls": "Controls",
  "iridium.options.group.mouse": "Mouse",
  "iridium.options.mouse.mouseSensitivity.description": "Sets the sensitivity of the mouse's X (horizontal) and Y (vertical) axes. With a higher value, the camera will move faster when looking around.",
  "iridium.options.mouse.mouseWheelSensitivity.description": "Sets the sensitivity of the scroll wheel. Values higher than 1 do not affect selecting items in the hotbar.",
  "iridium.options.mouse.rawMouseInput.description": "If enabled, mouse input is sent directly to Minecraft rather than it being sent to Windows first, then Windows sending it to Minecraft. This means that mouse movements aren't affected by any mouse acceleration/scaling such as Windows' \"Enhance pointer precision\" setting.\n\n§lEnabled§r:\nMouse Movement -> Minecraft\n\n§lDisabled§r:\nMouse Movement -> Windows -> Minecraft",
  "iridium.options.mouse.discreteMouseScroll.description": "If enabled, the game will ignore scroll magnitude values reported by the operating system and instead act as if the operating system reported -1 or +1.",
  "iridium.options.mouse.invertMouse.description": "Inverts the mouse's vertical axis when looking around.",
  "iridium.options.mouse.touchscreenMode.description": "Toggles touchscreen mode. This is intended for use on devices with touchscreens.",
  "iridium.options.group.keyboard": "Keyboard",
  "iridium.options.keyboard.customizeKeybinds": "Customize Keybinds",
  "iridium.options.keyboard.customizeKeybinds.description": "Opens a separate screen where you can customize your keybinds.",
  "iridium.options.group.extraControls": "Extra Controls",
  "iridium.options.extraControls.sneak.description": "If set to 'Hold', you will sneak while holding down your sneak button.\n\nIf set to 'Toggle', sneaking can be toggled on or off.",
  "iridium.options.extraControls.sprint.description": "If set to 'Hold', you will sprint while holding down your sprint button.\n\nIf set to 'Toggle', sprinting can be toggled on or off.",
  "iridium.options.extraControls.autoJump.description": "If enabled, you will automatically jump if you walk near a block with nothing on top of it.",
  "iridium.options.extraControls.operatorItemsTab.description": "Enables the \"Operator Utilities\" tab in the creative inventory if the player has the appropriate permissions.",

  "iridium.options.category.online": "Online",
  "iridium.options.online.realmsNotifications.description": "Toggles on/off notifications for Realms.",
  "iridium.options.online.allowServerListing.description": "If enabled, your player name will appear in server listings.",

  "iridium.options.skinCustomisation.cape.description": "Toggles the cape on/off.\n\nIf set to off, the cape texture for wearing a pair of Elytra would also be disabled.",
  "iridium.options.skinCustomisation.jacket.description": "Toggles the second body layer on/off.",
  "iridium.options.skinCustomisation.leftSleeve.description": "Toggles the left arm's second layer on/off.",
  "iridium.options.skinCustomisation.rightSleeve.description": "Toggles the right arm's second layer on/off.",
  "iridium.options.skinCustomisation.leftPantsLeg.description": "Toggles the left leg's second layer on/off.",
  "iridium.options.skinCustomisation.rightPantsLeg.description": "Toggles the right leg's second layer on/off.",
  "iridium.options.skinCustomisation.hat.description": "Toggles the right leg's second layer on/off.",
  "iridium.options.skinCustomisation.mainHand.description": "Toggles the main hand between left and right.",

  "iridium.options.category.language": "Language",
  "iridium.options.language.customizeLanguage": "Customize Language",
  "iridium.options.language.customizeLanguage.description": "Opens a separate screen where you can configure your preferred language.",

  "iridium.options.category.chat": "Chat",
  "iridium.options.chat.chatVisibility": "Chat Visibility",
  "iridium.options.chat.chatVisibility.description": "Determines what parts of the in-game chat can be seen.\n\n§lShown§r - Player messages and command outputs can be seen.\n\n§lCommands Only§r - Only command outputs can be seen.\n\n§lHidden§r - Neither player message nor command outputs can be seen.",
  "iridium.options.chat.chatColors": "Chat Colors",
  "iridium.options.chat.chatColors.description": "If enabled, you will be able to see the in-game chat in many different colors.\n\nOtherwise, you can only see it in a white color.",
  "iridium.options.chat.chatDelay": "Chat Delay",
  "iridium.options.chat.chatDelay.description": "Determines the delay (in seconds) between chat messages being sent and them being displayed.",
  "iridium.options.chat.chatDelay.none": "None",
  "iridium.options.chat.chatDelay.seconds": "%s Seconds",
  "iridium.options.chat.links.description": "If enabled, you will be able to see URLs and other links in the chat.\n\nOtherwise, this will block all URLs and other links in the chat.",
  "iridium.options.chat.links.prompt.description": "If enabled, whenever you click on a URL anywhere in-game, a prompt will appear confirming that you would like to visit that URL.",
  "iridium.options.chat.opacity.description": "Sets the opacity of the text within the chat.",
  "iridium.options.chat.textBackgroundOpacity.description": "Sets the opacity of the text's background.",
  "iridium.options.chat.scale.description": "Determines how large the chat is shown.",
  "iridium.options.chat.lineSpacing.description": "Determines the amount of spacing between chat messages.",
  "iridium.options.chat.width.description": "Determines the maximum width that chat messages may appear in.",
  "iridium.options.chat.focusedHeight.description": "Determines the maximum vertical size that the chat appears in when it is in focus (which is when chat input and the chat history are open).",
  "iridium.options.chat.unfocusedHeight.description": "Determines the maximum vertical size that the chat appears in when it is unfocused (which is when chat input and the chat history are closed).",
  "iridium.options.chat.narrator.description": "Determines whether the narrator is on or off and what it reads.\n\n§lOff§r - The narrator is disabled.\n\n§lAll§r - The narrator reads both chat and system messages.\n\n§lChat§r - The narrator only reads chat messages produced by players.\n\n§lSystem§r - The narrator only reads messages produced by the game (Command outputs, notifications, etc.).",
  "iridium.options.chat.commandSuggestions.description": "Determines if command suggestions appear or not.\n\nIf off, you have to press tab to bring them up.",
  "iridium.options.chat.hideMatchedNames.description": "Determines if the game will attempt to apply chat hiding by matching the text in the messages.",
  "iridium.options.chat.reducedDebugInfo.description": "If enabled, less information will be displayed in the debug menu.",
  "iridium.options.chat.onlyShowSecureChat.description": "Determines whether or not the chat will display cryptographically signed messages.\n\nThis may result in alterations by the server, such as chat styling not being displayed properly.",

  "iridium.options.category.accessibility": "Accessibility",
  "iridium.options.accessibility.highContrast.description": "Enhances the contrast on the game's UI elements.",
  "iridium.options.accessibility.darknessPulsing.description": "Determines how dark the darkness effect gets when a Warden or Sculk Shrieker gives it to the player.\n\nThis setting doesn't affect fog distance.",
  "iridium.options.accessibility.damageTilt.description": "Controls the amount of camera shake that happens when you take damage.",
  "iridium.options.accessibility.glintSpeed.description": "Controls how fast the visual glint shimmers across enchanted items.",
  "iridium.options.accessibility.glintStrength.description": "Controls how fast the visual glint shimmers across enchanted items.",
  "iridium.options.accessibility.hideLightningFlashes.description": "If enabled, the screen won't flash when lightning strikes.\n\nThe lightning bolts themselves will still be visible.",
  "iridium.options.accessibility.darkMojangStudiosBackgroundColor.description": "If enabled, the Mojang Studios loading screen color will be black instead of red.",
  "iridium.options.accessibility.panoramaScrollSpeed.description": "Determines the scrolling speed of the panorama in the title screen.",
  "iridium.options.accessibility.hideSplashTexts.description": "If enabled, the splash texts on the title screen will be hidden.",
  "iridium.options.accessibility.narratorHotkey.description": "Toggles on/off the ability to turn the narrator on and off with Ctrl + B (Cmd + B on Mac).",

  "iridium.options.category.extras": "Extras",
  "iridium.options.group.extras": "Extras",
  "iridium.options.extras.telemetryData": "Telemetry Data",
  "iridium.options.extras.telemetryData.description": "Opens a separate screen where you can view your telemetry data.",
  "iridium.options.group.credits": "Credits and Attribution",
  "iridium.options.credits.credits.description": "View all of those who have contributed to Minecraft's creation.",
  "iridium.options.credits.attribution.description": "View the game's attributions.",
  "iridium.options.credits.licenses.description": "View the game's licensing.",

  "iridium.options.category.renderer": "Renderer",
  "iridium.options.renderer.enableShaderCaching": "Enable Shader Caching",
  "iridium.options.renderer.enableShaderCaching.description": "Shader compilation is a relatively expensive operation, especially on lower-end hardware. By caching shaders, the need to compile shaders every time you launch the game is eliminated, therefore potentially improving load times.\n\nHowever, caching shaders can potentially consume a lot of storage space and/or cause issues if used on a graphics driver that is different from the one that they were originally compiled on.",
  "iridium.options.renderer.framesInFlight": "Frames In Flight",
  "iridium.options.renderer.framesInFlight.description": "Determines the maximum number of frames that the CPU can be waiting on the GPU to finish rendering.\n\nSetting this value too low or too high can create instabilities in your framerate.\n\nUpon changing this setting, a game restart is required in order for it to take effect."
}